# Лабораторная работа №6
## Вариант 4
## Задания
1. Написать программы для варианта 6;
2. Оформить отсчет в README.md (это он и есть);
Отсчет включает в себя: условия задач, скриншоты результатов, рабочий код.

## Задания варианта:
1.Настя составляет 6-буквенные коды из букв Н, А, С, Т, Я. Каждая допустимая гласная буква может входить в код не более одного раза. Сколько кодов может составить Настя?
## Код
``` py
import itertools
alphabet = "НАСТЯ"
ar = itertools.product(alphabet, repeat = 6)
arl = []
for i in ar:
    arl.append(list(i))
count = 0
for e in arl:
    if e.count("A") <= 1 and e.count("Я") <= 1:
        count += 1
print(count)
```
## Ответ:6075

2.Значение арифметического выражения 16^18 ⋅ 4^10 − 46 − 16 записали в системе счисления с основанием 4. Сколько цифр 3 содержится в этой записи?
## Код 
```py
x = 16 ** 8 * 4 ** 10 - 46 - 16
a = ''
while x != 0:
    a += str(x % 4)
    x //= 4
a = a[::-1]
print(a.count("3"))
```
## Ответ 23

3.Пусть MMM  — сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то считаем значение M равным нулю. Найдите целые числа, большие 452 021, в порядке возрастания, такие, для которых значение MMM при делении на 7 даёт в остатке 3. Вывести первые 5 найденных чисел и соответствующие им значения MMM.

Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число, затем  — значение MMM. Строки выводятся в порядке возрастания найденных чисел.
``` py
def find_numbers(start):
    result = []
    for num in range(start, float('inf')):
        min_divisor, max_divisor = find_min_max_divisors(num)
        M = min_divisor + max_divisor
        if M % 7 == 3:
            result.append((num, M))
            if len(result) == 5:
                break
    return result
    
from math import sqrt

def find_min_max_divisors(num):
    if num == 1:
        return None, None # Нет делителей, кроме 1
    for i in range(2, int(sqrt(num)) + 1):
        if num % i == 0:
            return i, num // i
    return num, 1


    for num, M in result:
        print(f"Число: {num}, M: {M}")
```
## Ответ:

